GopalSaraf/Practicals/PSDL/include/proc/pic18f65j94.inc
// Register: UEP14
#define UEP14 UEP14
UEP14                                    equ 0E0Dh
// bitfield definitions
UEP14_EPSTALL_POSN                       equ 0000h
UEP14_EPSTALL_POSITION                   equ 0000h
UEP14_EPSTALL_SIZE                       equ 0001h
UEP14_EPSTALL_LENGTH                     equ 0001h
UEP14_EPSTALL_MASK                       equ 0001h
UEP14_EPINEN_POSN                        equ 0001h
UEP14_EPINEN_POSITION                    equ 0001h
UEP14_EPINEN_SIZE                        equ 0001h
UEP14_EPINEN_LENGTH                      equ 0001h
UEP14_EPINEN_MASK                        equ 0002h
UEP14_EPOUTEN_POSN                       equ 0002h
UEP14_EPOUTEN_POSITION                   equ 0002h
UEP14_EPOUTEN_SIZE                       equ 0001h
UEP14_EPOUTEN_LENGTH                     equ 0001h
UEP14_EPOUTEN_MASK                       equ 0004h
UEP14_EPCONDIS_POSN                      equ 0003h
UEP14_EPCONDIS_POSITION                  equ 0003h
UEP14_EPCONDIS_SIZE                      equ 0001h
UEP14_EPCONDIS_LENGTH                    equ 0001h
UEP14_EPCONDIS_MASK                      equ 0008h
UEP14_EPHSHK_POSN                        equ 0004h
UEP14_EPHSHK_POSITION                    equ 0004h
UEP14_EPHSHK_SIZE                        equ 0001h
UEP14_EPHSHK_LENGTH                      equ 0001h
UEP14_EPHSHK_MASK                        equ 0010h
UEP14_EPSTALL14_POSN                     equ 0000h
UEP14_EPSTALL14_POSITION                 equ 0000h
UEP14_EPSTALL14_SIZE                     equ 0001h
UEP14_EPSTALL14_LENGTH                   equ 0001h
UEP14_EPSTALL14_MASK                     equ 0001h
UEP14_EPINEN14_POSN                      equ 0001h
UEP14_EPINEN14_POSITION                  equ 0001h
UEP14_EPINEN14_SIZE                      equ 0001h
UEP14_EPINEN14_LENGTH                    equ 0001h
UEP14_EPINEN14_MASK                      equ 0002h
UEP14_EPOUTEN14_POSN                     equ 0002h
UEP14_EPOUTEN14_POSITION                 equ 0002h
UEP14_EPOUTEN14_SIZE                     equ 0001h
UEP14_EPOUTEN14_LENGTH                   equ 0001h
UEP14_EPOUTEN14_MASK                     equ 0004h
UEP14_EPCONDIS14_POSN                    equ 0003h
UEP14_EPCONDIS14_POSITION                equ 0003h
UEP14_EPCONDIS14_SIZE                    equ 0001h
UEP14_EPCONDIS14_LENGTH                  equ 0001h
UEP14_EPCONDIS14_MASK                    equ 0008h
UEP14_EPHSHK14_POSN                      equ 0004h
UEP14_EPHSHK14_POSITION                  equ 0004h
UEP14_EPHSHK14_SIZE                      equ 0001h
UEP14_EPHSHK14_LENGTH                    equ 0001h
UEP14_EPHSHK14_MASK                      equ 0010h

// Register: UEP15
#define UEP15 UEP15
UEP15                                    equ 0E0Eh
// bitfield definitions
UEP15_EPSTALL_POSN                       equ 0000h
UEP15_EPSTALL_POSITION                   equ 0000h
UEP15_EPSTALL_SIZE                       equ 0001h
UEP15_EPSTALL_LENGTH                     equ 0001h
UEP15_EPSTALL_MASK                       equ 0001h
UEP15_EPINEN_POSN                        equ 0001h
UEP15_EPINEN_POSITION                    equ 0001h
UEP15_EPINEN_SIZE                        equ 0001h
UEP15_EPINEN_LENGTH                      equ 0001h
UEP15_EPINEN_MASK                        equ 0002h
UEP15_EPOUTEN_POSN                       equ 0002h
UEP15_EPOUTEN_POSITION                   equ 0002h
UEP15_EPOUTEN_SIZE                       equ 0001h
UEP15_EPOUTEN_LENGTH                     equ 0001h
UEP15_EPOUTEN_MASK                       equ 0004h
UEP15_EPCONDIS_POSN                      equ 0003h
UEP15_EPCONDIS_POSITION                  equ 0003h
UEP15_EPCONDIS_SIZE                      equ 0001h
UEP15_EPCONDIS_LENGTH                    equ 0001h
UEP15_EPCONDIS_MASK                      equ 0008h
UEP15_EPHSHK_POSN                        equ 0004h
UEP15_EPHSHK_POSITION                    equ 0004h
UEP15_EPHSHK_SIZE                        equ 0001h
UEP15_EPHSHK_LENGTH                      equ 0001h
UEP15_EPHSHK_MASK                        equ 0010h
UEP15_EPSTALL15_POSN                     equ 0000h
UEP15_EPSTALL15_POSITION                 equ 0000h
UEP15_EPSTALL15_SIZE                     equ 0001h
UEP15_EPSTALL15_LENGTH                   equ 0001h
UEP15_EPSTALL15_MASK                     equ 0001h
UEP15_EPINEN15_POSN                      equ 0001h
UEP15_EPINEN15_POSITION                  equ 0001h
UEP15_EPINEN15_SIZE                      equ 0001h
UEP15_EPINEN15_LENGTH                    equ 0001h
UEP15_EPINEN15_MASK                      equ 0002h
UEP15_EPOUTEN15_POSN                     equ 0002h
UEP15_EPOUTEN15_POSITION                 equ 0002h
UEP15_EPOUTEN15_SIZE                     equ 0001h
UEP15_EPOUTEN15_LENGTH                   equ 0001h
UEP15_EPOUTEN15_MASK                     equ 0004h
UEP15_EPCONDIS15_POSN                    equ 0003h
UEP15_EPCONDIS15_POSITION                equ 0003h
UEP15_EPCONDIS15_SIZE                    equ 0001h
UEP15_EPCONDIS15_LENGTH                  equ 0001h
UEP15_EPCONDIS15_MASK                    equ 0008h
UEP15_EPHSHK15_POSN                      equ 0004h
UEP15_EPHSHK15_POSITION                  equ 0004h
UEP15_EPHSHK15_SIZE                      equ 0001h
UEP15_EPHSHK15_LENGTH                    equ 0001h
UEP15_EPHSHK15_MASK                      equ 0010h

// Register: UEIE
#define UEIE UEIE
UEIE                                     equ 0E0Fh
// bitfield definitions
UEIE_PIDEE_POSN                          equ 0000h
UEIE_PIDEE_POSITION                      equ 0000h
UEIE_PIDEE_SIZE                          equ 0001h
UEIE_PIDEE_LENGTH                        equ 0001h
UEIE_PIDEE_MASK                          equ 0001h
UEIE_CRC5EE_POSN                         equ 0001h
UEIE_CRC5EE_POSITION                     equ 0001h
UEIE_CRC5EE_SIZE                         equ 0001h
UEIE_CRC5EE_LENGTH                       equ 0001h
UEIE_CRC5EE_MASK                         equ 0002h
UEIE_CRC16EE_POSN                        equ 0002h
UEIE_CRC16EE_POSITION                    equ 0002h
UEIE_CRC16EE_SIZE                        equ 0001h
UEIE_CRC16EE_LENGTH                      equ 0001h
UEIE_CRC16EE_MASK                        equ 0004h
UEIE_DFN8EE_POSN                         equ 0003h
UEIE_DFN8EE_POSITION                     equ 0003h
UEIE_DFN8EE_SIZE                         equ 0001h
UEIE_DFN8EE_LENGTH                       equ 0001h
UEIE_DFN8EE_MASK                         equ 0008h
UEIE_BTOEE_POSN                          equ 0004h
UEIE_BTOEE_POSITION                      equ 0004h
UEIE_BTOEE_SIZE                          equ 0001h
UEIE_BTOEE_LENGTH                        equ 0001h
UEIE_BTOEE_MASK                          equ 0010h
UEIE_BTSEE_POSN                          equ 0007h
UEIE_BTSEE_POSITION                      equ 0007h
UEIE_BTSEE_SIZE                          equ 0001h
UEIE_BTSEE_LENGTH                        equ 0001h
UEIE_BTSEE_MASK                          equ 0080h

// Register: UIE
#define UIE UIE
UIE                                      equ 0E10h
// bitfield definitions
UIE_URSTIE_POSN                          equ 0000h
UIE_URSTIE_POSITION                      equ 0000h
UIE_URSTIE_SIZE                          equ 0001h
UIE_URSTIE_LENGTH                        equ 0001h
UIE_URSTIE_MASK                          equ 0001h
UIE_UERRIE_POSN                          equ 0001h
UIE_UERRIE_POSITION                      equ 0001h
UIE_UERRIE_SIZE                          equ 0001h
UIE_UERRIE_LENGTH                        equ 0001h
UIE_UERRIE_MASK                          equ 0002h
UIE_ACTVIE_POSN                          equ 0002h
UIE_ACTVIE_POSITION                      equ 0002h
UIE_ACTVIE_SIZE                          equ 0001h
UIE_ACTVIE_LENGTH                        equ 0001h
UIE_ACTVIE_MASK                          equ 0004h
UIE_TRNIE_POSN                           equ 0003h
UIE_TRNIE_POSITION                       equ 0003h
UIE_TRNIE_SIZE                           equ 0001h
UIE_TRNIE_LENGTH                         equ 0001h
UIE_TRNIE_MASK                           equ 0008h
UIE_IDLEIE_POSN                          equ 0004h
UIE_IDLEIE_POSITION                      equ 0004h
UIE_IDLEIE_SIZE                          equ 0001h
UIE_IDLEIE_LENGTH                        equ 0001h
UIE_IDLEIE_MASK                          equ 0010h
UIE_STALLIE_POSN                         equ 0005h
UIE_STALLIE_POSITION                     equ 0005h
UIE_STALLIE_SIZE                         equ 0001h
UIE_STALLIE_LENGTH                       equ 0001h
UIE_STALLIE_MASK                         equ 0020h
UIE_SOFIE_POSN                           equ 0006h
UIE_SOFIE_POSITION                       equ 0006h
UIE_SOFIE_SIZE                           equ 0001h
UIE_SOFIE_LENGTH                         equ 0001h
UIE_SOFIE_MASK                           equ 0040h

// Register: UCFG
#define UCFG UCFG
UCFG                                     equ 0E11h
// bitfield definitions
UCFG_PPB0_POSN                           equ 0000h
UCFG_PPB0_POSITION                       equ 0000h
UCFG_PPB0_SIZE                           equ 0001h
UCFG_PPB0_LENGTH                         equ 0001h
UCFG_PPB0_MASK                           equ 0001h
UCFG_PPB1_POSN                           equ 0001h
UCFG_PPB1_POSITION                       equ 0001h
UCFG_PPB1_SIZE                           equ 0001h
UCFG_PPB1_LENGTH                         equ 0001h
UCFG_PPB1_MASK                           equ 0002h
UCFG_FSEN_POSN                           equ 0002h
UCFG_FSEN_POSITION                       equ 0002h
UCFG_FSEN_SIZE                           equ 0001h
UCFG_FSEN_LENGTH                         equ 0001h
UCFG_FSEN_MASK                           equ 0004h
UCFG_UTRDIS_POSN                         equ 0003h
UCFG_UTRDIS_POSITION                     equ 0003h
UCFG_UTRDIS_SIZE                         equ 0001h
UCFG_UTRDIS_LENGTH                       equ 0001h
UCFG_UTRDIS_MASK                         equ 0008h
UCFG_UPUEN_POSN                          equ 0004h
UCFG_UPUEN_POSITION                      equ 0004h
UCFG_UPUEN_SIZE                          equ 0001h
UCFG_UPUEN_LENGTH                        equ 0001h
UCFG_UPUEN_MASK                          equ 0010h
UCFG_UOEMON_POSN                         equ 0006h
UCFG_UOEMON_POSITION                     equ 0006h
UCFG_UOEMON_SIZE                         equ 0001h
UCFG_UOEMON_LENGTH                       equ 0001h
UCFG_UOEMON_MASK                         equ 0040h
UCFG_UTEYE_POSN                          equ 0007h
UCFG_UTEYE_POSITION                      equ 0007h
UCFG_UTEYE_SIZE                          equ 0001h
UCFG_UTEYE_LENGTH                        equ 0001h
UCFG_UTEYE_MASK                          equ 0080h
UCFG_UPP0_POSN                           equ 0000h
UCFG_UPP0_POSITION                       equ 0000h
UCFG_UPP0_SIZE                           equ 0001h
UCFG_UPP0_LENGTH                         equ 0001h
UCFG_UPP0_MASK                           equ 0001h
UCFG_UPP1_POSN                           equ 0001h
UCFG_UPP1_POSITION                       equ 0001h
UCFG_UPP1_SIZE                           equ 0001h
UCFG_UPP1_LENGTH                         equ 0001h
UCFG_UPP1_MASK                           equ 0002h

// Register: RPOR0_1
#define RPOR0_1 RPOR0_1
RPOR0_1                                  equ 0E12h
// bitfield definitions
RPOR0_1_RPO0R_POSN                       equ 0000h
RPOR0_1_RPO0R_POSITION                   equ 0000h
RPOR0_1_RPO0R_SIZE                       equ 0004h
RPOR0_1_RPO0R_LENGTH                     equ 0004h
RPOR0_1_RPO0R_MASK                       equ 000Fh
RPOR0_1_RPO1R_POSN                       equ 0004h
RPOR0_1_RPO1R_POSITION                   equ 0004h
RPOR0_1_RPO1R_SIZE                       equ 0004h
RPOR0_1_RPO1R_LENGTH                     equ 0004h
RPOR0_1_RPO1R_MASK                       equ 00F0h
RPOR0_1_RPO0R0_POSN                      equ 0000h
RPOR0_1_RPO0R0_POSITION                  equ 0000h
RPOR0_1_RPO0R0_SIZE                      equ 0001h
RPOR0_1_RPO0R0_LENGTH                    equ 0001h
RPOR0_1_RPO0R0_MASK                      equ 0001h
RPOR0_1_RPO0R1_POSN                      equ 0001h
RPOR0_1_RPO0R1_POSITION                  equ 0001h
RPOR0_1_RPO0R1_SIZE                      equ 0001h
RPOR0_1_RPO0R1_LENGTH                    equ 0001h
RPOR0_1_RPO0R1_MASK                      equ 0002h
RPOR0_1_RPO0R2_POSN                      equ 0002h
RPOR0_1_RPO0R2_POSITION                  equ 0002h
RPOR0_1_RPO0R2_SIZE                      equ 0001h
RPOR0_1_RPO0R2_LENGTH                    equ 0001h
RPOR0_1_RPO0R2_MASK                      equ 0004h
RPOR0_1_RPO0R3_POSN                      equ 0003h
RPOR0_1_RPO0R3_POSITION                  equ 0003h
RPOR0_1_RPO0R3_SIZE                      equ 0001h
RPOR0_1_RPO0R3_LENGTH                    equ 0001h
RPOR0_1_RPO0R3_MASK                      equ 0008h
RPOR0_1_RPO1R0_POSN                      equ 0004h
RPOR0_1_RPO1R0_POSITION                  equ 0004h
RPOR0_1_RPO1R0_SIZE                      equ 0001h
RPOR0_1_RPO1R0_LENGTH                    equ 0001h
RPOR0_1_RPO1R0_MASK                      equ 0010h
RPOR0_1_RPO1R1_POSN                      equ 0005h
RPOR0_1_RPO1R1_POSITION                  equ 0005h
RPOR0_1_RPO1R1_SIZE                      equ 0001h
RPOR0_1_RPO1R1_LENGTH                    equ 0001h
RPOR0_1_RPO1R1_MASK                      equ 0020h
RPOR0_1_RPO1R2_POSN                      equ 0006h
RPOR0_1_RPO1R2_POSITION                  equ 0006h
RPOR0_1_RPO1R2_SIZE                      equ 0001h
RPOR0_1_RPO1R2_LENGTH                    equ 0001h
RPOR0_1_RPO1R2_MASK                      equ 0040h
RPOR0_1_RPO1R3_POSN                      equ 0007h
RPOR0_1_RPO1R3_POSITION                  equ 0007h
RPOR0_1_RPO1R3_SIZE                      equ 0001h
RPOR0_1_RPO1R3_LENGTH                    equ 0001h
RPOR0_1_RPO1R3_MASK                      equ 0080h

// Register: RPOR2_3
#define RPOR2_3 RPOR2_3
RPOR2_3                                  equ 0E13h
// bitfield definitions
RPOR2_3_RPO2R_POSN                       equ 0000h
RPOR2_3_RPO2R_POSITION                   equ 0000h
RPOR2_3_RPO2R_SIZE                       equ 0004h
RPOR2_3_RPO2R_LENGTH                     equ 0004h
RPOR2_3_RPO2R_MASK                       equ 000Fh
RPOR2_3_RPO3R_POSN                       equ 0004h
RPOR2_3_RPO3R_POSITION                   equ 0004h
RPOR2_3_RPO3R_SIZE                       equ 0004h
RPOR2_3_RPO3R_LENGTH                     equ 0004h
RPOR2_3_RPO3R_MASK                       equ 00F0h
RPOR2_3_RPO2R0_POSN                      equ 0000h
RPOR2_3_RPO2R0_POSITION                  equ 0000h
RPOR2_3_RPO2R0_SIZE                      equ 0001h
RPOR2_3_RPO2R0_LENGTH                    equ 0001h
RPOR2_3_RPO2R0_MASK                      equ 0001h
RPOR2_3_RPO2R1_POSN                      equ 0001h
RPOR2_3_RPO2R1_POSITION                  equ 0001h
RPOR2_3_RPO2R1_SIZE                      equ 0001h
RPOR2_3_RPO2R1_LENGTH                    equ 0001h
RPOR2_3_RPO2R1_MASK                      equ 0002h
RPOR2_3_RPO2R2_POSN                      equ 0002h
RPOR2_3_RPO2R2_POSITION                  equ 0002h
RPOR2_3_RPO2R2_SIZE                      equ 0001h
RPOR2_3_RPO2R2_LENGTH                    equ 0001h
RPOR2_3_RPO2R2_MASK                      equ 0004h
RPOR2_3_RPO2R3_POSN                      equ 0003h
RPOR2_3_RPO2R3_POSITION                  equ 0003h
RPOR2_3_RPO2R3_SIZE                      equ 0001h
RPOR2_3_RPO2R3_LENGTH                    equ 0001h
RPOR2_3_RPO2R3_MASK                      equ 0008h
RPOR2_3_RPO3R0_POSN                      equ 0004h
RPOR2_3_RPO3R0_POSITION                  equ 0004h
RPOR2_3_RPO3R0_SIZE                      equ 0001h
RPOR2_3_RPO3R0_LENGTH                    equ 0001h
RPOR2_3_RPO3R0_MASK                      equ 0010h
RPOR2_3_RPO3R1_POSN                      equ 0005h
RPOR2_3_RPO3R1_POSITION                  equ 0005h
RPOR2_3_RPO3R1_SIZE                      equ 0001h
RPOR2_3_RPO3R1_LENGTH                    equ 0001h
RPOR2_3_RPO3R1_MASK                      equ 0020h
RPOR2_3_RPO3R2_POSN                      equ 0006h
RPOR2_3_RPO3R2_POSITION                  equ 0006h
RPOR2_3_RPO3R2_SIZE                      equ 0001h
RPOR2_3_RPO3R2_LENGTH                    equ 0001h
RPOR2_3_RPO3R2_MASK                      equ 0040h
RPOR2_3_RPO3R3_POSN                      equ 0007h
RPOR2_3_RPO3R3_POSITION                  equ 0007h
RPOR2_3_RPO3R3_SIZE                      equ 0001h
RPOR2_3_RPO3R3_LENGTH                    equ 0001h
RPOR2_3_RPO3R3_MASK                      equ 0080h

// Register: RPOR4_5
#define RPOR4_5 RPOR4_5
RPOR4_5                                  equ 0E14h
// bitfield definitions
RPOR4_5_RPO4R_POSN                       equ 0000h
RPOR4_5_RPO4R_POSITION                   equ 0000h
RPOR4_5_RPO4R_SIZE                       equ 0004h
RPOR4_5_RPO4R_LENGTH                     equ 0004h
RPOR4_5_RPO4R_MASK                       equ 000Fh
RPOR4_5_RPO5R_POSN                       equ 0004h
RPOR4_5_RPO5R_POSITION                   equ 0004h
RPOR4_5_RPO5R_SIZE                       equ 0004h
RPOR4_5_RPO5R_LENGTH                     equ 0004h
RPOR4_5_RPO5R_MASK                       equ 00F0h
RPOR4_5_RPO4R0_POSN                      equ 0000h
RPOR4_5_RPO4R0_POSITION                  equ 0000h
RPOR4_5_RPO4R0_SIZE                      equ 0001h
RPOR4_5_RPO4R0_LENGTH                    equ 0001h
RPOR4_5_RPO4R0_MASK                      equ 0001h
RPOR4_5_RPO4R1_POSN                      equ 0001h
RPOR4_5_RPO4R1_POSITION                  equ 0001h
RPOR4_5_RPO4R1_SIZE                      equ 0001h
RPOR4_5_RPO4R1_LENGTH                    equ 0001h
RPOR4_5_RPO4R1_MASK                      equ 0002h
RPOR4_5_RPO4R2_POSN                      equ 0002h
RPOR4_5_RPO4R2_POSITION                  equ 0002h
RPOR4_5_RPO4R2_SIZE                      equ 0001h
RPOR4_5_RPO4R2_LENGTH                    equ 0001h
RPOR4_5_RPO4R2_MASK                      equ 0004h
RPOR4_5_RPO4R3_POSN                      equ 0003h
RPOR4_5_RPO4R3_POSITION                  equ 0003h
RPOR4_5_RPO4R3_SIZE                      equ 0001h
RPOR4_5_RPO4R3_LENGTH                    equ 0001h
RPOR4_5_RPO4R3_MASK                      equ 0008h
RPOR4_5_RPO5R0_POSN                      equ 0004h
RPOR4_5_RPO5R0_POSITION                  equ 0004h
RPOR4_5_RPO5R0_SIZE                      equ 0001h
RPOR4_5_RPO5R0_LENGTH                    equ 0001h
RPOR4_5_RPO5R0_MASK                      equ 0010h
RPOR4_5_RPO5R1_POSN                      equ 0005h
RPOR4_5_RPO5R1_POSITION                  equ 0005h
RPOR4_5_RPO5R1_SIZE                      equ 0001h
RPOR4_5_RPO5R1_LENGTH                    equ 0001h
RPOR4_5_RPO5R1_MASK                      equ 0020h
RPOR4_5_RPO5R2_POSN                      equ 0006h
RPOR4_5_RPO5R2_POSITION                  equ 0006h
RPOR4_5_RPO5R2_SIZE                      equ 0001h
RPOR4_5_RPO5R2_LENGTH                    equ 0001h
RPOR4_5_RPO5R2_MASK                      equ 0040h
RPOR4_5_RPO5R3_POSN                      equ 0007h
RPOR4_5_RPO5R3_POSITION                  equ 0007h
RPOR4_5_RPO5R3_SIZE                      equ 0001h
RPOR4_5_RPO5R3_LENGTH                    equ 0001h
RPOR4_5_RPO5R3_MASK                      equ 0080h

