GopalSaraf/Practicals/PSDL/include/proc/pic18f65j94.inc
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
LCDDATA15                                equ 0E9Dh
// bitfield definitions
LCDDATA15_S56C1_POSN                     equ 0000h
LCDDATA15_S56C1_POSITION                 equ 0000h
LCDDATA15_S56C1_SIZE                     equ 0001h
LCDDATA15_S56C1_LENGTH                   equ 0001h
LCDDATA15_S56C1_MASK                     equ 0001h
LCDDATA15_S57C1_POSN                     equ 0001h
LCDDATA15_S57C1_POSITION                 equ 0001h
LCDDATA15_S57C1_SIZE                     equ 0001h
LCDDATA15_S57C1_LENGTH                   equ 0001h
LCDDATA15_S57C1_MASK                     equ 0002h
LCDDATA15_S58C1_POSN                     equ 0002h
LCDDATA15_S58C1_POSITION                 equ 0002h
LCDDATA15_S58C1_SIZE                     equ 0001h
LCDDATA15_S58C1_LENGTH                   equ 0001h
LCDDATA15_S58C1_MASK                     equ 0004h
LCDDATA15_S59C1_POSN                     equ 0003h
LCDDATA15_S59C1_POSITION                 equ 0003h
LCDDATA15_S59C1_SIZE                     equ 0001h
LCDDATA15_S59C1_LENGTH                   equ 0001h
LCDDATA15_S59C1_MASK                     equ 0008h
LCDDATA15_S60C1_POSN                     equ 0004h
LCDDATA15_S60C1_POSITION                 equ 0004h
LCDDATA15_S60C1_SIZE                     equ 0001h
LCDDATA15_S60C1_LENGTH                   equ 0001h
LCDDATA15_S60C1_MASK                     equ 0010h
LCDDATA15_S61C1_POSN                     equ 0005h
LCDDATA15_S61C1_POSITION                 equ 0005h
LCDDATA15_S61C1_SIZE                     equ 0001h
LCDDATA15_S61C1_LENGTH                   equ 0001h
LCDDATA15_S61C1_MASK                     equ 0020h
LCDDATA15_S62C1_POSN                     equ 0006h
LCDDATA15_S62C1_POSITION                 equ 0006h
LCDDATA15_S62C1_SIZE                     equ 0001h
LCDDATA15_S62C1_LENGTH                   equ 0001h
LCDDATA15_S62C1_MASK                     equ 0040h
LCDDATA15_S63C1_POSN                     equ 0007h
LCDDATA15_S63C1_POSITION                 equ 0007h
LCDDATA15_S63C1_SIZE                     equ 0001h
LCDDATA15_S63C1_LENGTH                   equ 0001h
LCDDATA15_S63C1_MASK                     equ 0080h

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
LCDDATA16                                equ 0E9Eh
// bitfield definitions
LCDDATA16_S00C2_POSN                     equ 0000h
LCDDATA16_S00C2_POSITION                 equ 0000h
LCDDATA16_S00C2_SIZE                     equ 0001h
LCDDATA16_S00C2_LENGTH                   equ 0001h
LCDDATA16_S00C2_MASK                     equ 0001h
LCDDATA16_S01C2_POSN                     equ 0001h
LCDDATA16_S01C2_POSITION                 equ 0001h
LCDDATA16_S01C2_SIZE                     equ 0001h
LCDDATA16_S01C2_LENGTH                   equ 0001h
LCDDATA16_S01C2_MASK                     equ 0002h
LCDDATA16_S02C2_POSN                     equ 0002h
LCDDATA16_S02C2_POSITION                 equ 0002h
LCDDATA16_S02C2_SIZE                     equ 0001h
LCDDATA16_S02C2_LENGTH                   equ 0001h
LCDDATA16_S02C2_MASK                     equ 0004h
LCDDATA16_S03C2_POSN                     equ 0003h
LCDDATA16_S03C2_POSITION                 equ 0003h
LCDDATA16_S03C2_SIZE                     equ 0001h
LCDDATA16_S03C2_LENGTH                   equ 0001h
LCDDATA16_S03C2_MASK                     equ 0008h
LCDDATA16_S04C2_POSN                     equ 0004h
LCDDATA16_S04C2_POSITION                 equ 0004h
LCDDATA16_S04C2_SIZE                     equ 0001h
LCDDATA16_S04C2_LENGTH                   equ 0001h
LCDDATA16_S04C2_MASK                     equ 0010h
LCDDATA16_S05C2_POSN                     equ 0005h
LCDDATA16_S05C2_POSITION                 equ 0005h
LCDDATA16_S05C2_SIZE                     equ 0001h
LCDDATA16_S05C2_LENGTH                   equ 0001h
LCDDATA16_S05C2_MASK                     equ 0020h
LCDDATA16_S06C2_POSN                     equ 0006h
LCDDATA16_S06C2_POSITION                 equ 0006h
LCDDATA16_S06C2_SIZE                     equ 0001h
LCDDATA16_S06C2_LENGTH                   equ 0001h
LCDDATA16_S06C2_MASK                     equ 0040h
LCDDATA16_S07C2_POSN                     equ 0007h
LCDDATA16_S07C2_POSITION                 equ 0007h
LCDDATA16_S07C2_SIZE                     equ 0001h
LCDDATA16_S07C2_LENGTH                   equ 0001h
LCDDATA16_S07C2_MASK                     equ 0080h
LCDDATA16_T4CKPS016_POSN                 equ 0000h
LCDDATA16_T4CKPS016_POSITION             equ 0000h
LCDDATA16_T4CKPS016_SIZE                 equ 0001h
LCDDATA16_T4CKPS016_LENGTH               equ 0001h
LCDDATA16_T4CKPS016_MASK                 equ 0001h
LCDDATA16_T4CKPS116_POSN                 equ 0001h
LCDDATA16_T4CKPS116_POSITION             equ 0001h
LCDDATA16_T4CKPS116_SIZE                 equ 0001h
LCDDATA16_T4CKPS116_LENGTH               equ 0001h
LCDDATA16_T4CKPS116_MASK                 equ 0002h
LCDDATA16_T4OUTPS016_POSN                equ 0003h
LCDDATA16_T4OUTPS016_POSITION            equ 0003h
LCDDATA16_T4OUTPS016_SIZE                equ 0001h
LCDDATA16_T4OUTPS016_LENGTH              equ 0001h
LCDDATA16_T4OUTPS016_MASK                equ 0008h
LCDDATA16_T4OUTPS116_POSN                equ 0004h
LCDDATA16_T4OUTPS116_POSITION            equ 0004h
LCDDATA16_T4OUTPS116_SIZE                equ 0001h
LCDDATA16_T4OUTPS116_LENGTH              equ 0001h
LCDDATA16_T4OUTPS116_MASK                equ 0010h
LCDDATA16_T4OUTPS216_POSN                equ 0005h
LCDDATA16_T4OUTPS216_POSITION            equ 0005h
LCDDATA16_T4OUTPS216_SIZE                equ 0001h
LCDDATA16_T4OUTPS216_LENGTH              equ 0001h
LCDDATA16_T4OUTPS216_MASK                equ 0020h
LCDDATA16_T4OUTPS316_POSN                equ 0006h
LCDDATA16_T4OUTPS316_POSITION            equ 0006h
LCDDATA16_T4OUTPS316_SIZE                equ 0001h
LCDDATA16_T4OUTPS316_LENGTH              equ 0001h
LCDDATA16_T4OUTPS316_MASK                equ 0040h

// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
LCDDATA17                                equ 0E9Fh
// bitfield definitions
LCDDATA17_S08C2_POSN                     equ 0000h
LCDDATA17_S08C2_POSITION                 equ 0000h
LCDDATA17_S08C2_SIZE                     equ 0001h
LCDDATA17_S08C2_LENGTH                   equ 0001h
LCDDATA17_S08C2_MASK                     equ 0001h
LCDDATA17_S09C2_POSN                     equ 0001h
LCDDATA17_S09C2_POSITION                 equ 0001h
LCDDATA17_S09C2_SIZE                     equ 0001h
LCDDATA17_S09C2_LENGTH                   equ 0001h
LCDDATA17_S09C2_MASK                     equ 0002h
LCDDATA17_S10C2_POSN                     equ 0002h
LCDDATA17_S10C2_POSITION                 equ 0002h
LCDDATA17_S10C2_SIZE                     equ 0001h
LCDDATA17_S10C2_LENGTH                   equ 0001h
LCDDATA17_S10C2_MASK                     equ 0004h
LCDDATA17_S11C2_POSN                     equ 0003h
LCDDATA17_S11C2_POSITION                 equ 0003h
LCDDATA17_S11C2_SIZE                     equ 0001h
LCDDATA17_S11C2_LENGTH                   equ 0001h
LCDDATA17_S11C2_MASK                     equ 0008h
LCDDATA17_S12C2_POSN                     equ 0004h
LCDDATA17_S12C2_POSITION                 equ 0004h
LCDDATA17_S12C2_SIZE                     equ 0001h
LCDDATA17_S12C2_LENGTH                   equ 0001h
LCDDATA17_S12C2_MASK                     equ 0010h
LCDDATA17_S13C2_POSN                     equ 0005h
LCDDATA17_S13C2_POSITION                 equ 0005h
LCDDATA17_S13C2_SIZE                     equ 0001h
LCDDATA17_S13C2_LENGTH                   equ 0001h
LCDDATA17_S13C2_MASK                     equ 0020h
LCDDATA17_S14C2_POSN                     equ 0006h
LCDDATA17_S14C2_POSITION                 equ 0006h
LCDDATA17_S14C2_SIZE                     equ 0001h
LCDDATA17_S14C2_LENGTH                   equ 0001h
LCDDATA17_S14C2_MASK                     equ 0040h
LCDDATA17_S15C2_POSN                     equ 0007h
LCDDATA17_S15C2_POSITION                 equ 0007h
LCDDATA17_S15C2_SIZE                     equ 0001h
LCDDATA17_S15C2_LENGTH                   equ 0001h
LCDDATA17_S15C2_MASK                     equ 0080h

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
LCDDATA18                                equ 0EA0h
// bitfield definitions
LCDDATA18_S16C2_POSN                     equ 0000h
LCDDATA18_S16C2_POSITION                 equ 0000h
LCDDATA18_S16C2_SIZE                     equ 0001h
LCDDATA18_S16C2_LENGTH                   equ 0001h
LCDDATA18_S16C2_MASK                     equ 0001h
LCDDATA18_S17C2_POSN                     equ 0001h
LCDDATA18_S17C2_POSITION                 equ 0001h
LCDDATA18_S17C2_SIZE                     equ 0001h
LCDDATA18_S17C2_LENGTH                   equ 0001h
LCDDATA18_S17C2_MASK                     equ 0002h
LCDDATA18_S18C2_POSN                     equ 0002h
LCDDATA18_S18C2_POSITION                 equ 0002h
LCDDATA18_S18C2_SIZE                     equ 0001h
LCDDATA18_S18C2_LENGTH                   equ 0001h
LCDDATA18_S18C2_MASK                     equ 0004h
LCDDATA18_S19C2_POSN                     equ 0003h
LCDDATA18_S19C2_POSITION                 equ 0003h
LCDDATA18_S19C2_SIZE                     equ 0001h
LCDDATA18_S19C2_LENGTH                   equ 0001h
LCDDATA18_S19C2_MASK                     equ 0008h
LCDDATA18_S20C2_POSN                     equ 0004h
LCDDATA18_S20C2_POSITION                 equ 0004h
LCDDATA18_S20C2_SIZE                     equ 0001h
LCDDATA18_S20C2_LENGTH                   equ 0001h
LCDDATA18_S20C2_MASK                     equ 0010h
LCDDATA18_S21C2_POSN                     equ 0005h
LCDDATA18_S21C2_POSITION                 equ 0005h
LCDDATA18_S21C2_SIZE                     equ 0001h
LCDDATA18_S21C2_LENGTH                   equ 0001h
LCDDATA18_S21C2_MASK                     equ 0020h
LCDDATA18_S22C2_POSN                     equ 0006h
LCDDATA18_S22C2_POSITION                 equ 0006h
LCDDATA18_S22C2_SIZE                     equ 0001h
LCDDATA18_S22C2_LENGTH                   equ 0001h
LCDDATA18_S22C2_MASK                     equ 0040h
LCDDATA18_S23C2_POSN                     equ 0007h
LCDDATA18_S23C2_POSITION                 equ 0007h
LCDDATA18_S23C2_SIZE                     equ 0001h
LCDDATA18_S23C2_LENGTH                   equ 0001h
LCDDATA18_S23C2_MASK                     equ 0080h

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
LCDDATA19                                equ 0EA1h
// bitfield definitions
LCDDATA19_S24C2_POSN                     equ 0000h
LCDDATA19_S24C2_POSITION                 equ 0000h
LCDDATA19_S24C2_SIZE                     equ 0001h
LCDDATA19_S24C2_LENGTH                   equ 0001h
LCDDATA19_S24C2_MASK                     equ 0001h
LCDDATA19_S25C2_POSN                     equ 0001h
LCDDATA19_S25C2_POSITION                 equ 0001h
LCDDATA19_S25C2_SIZE                     equ 0001h
LCDDATA19_S25C2_LENGTH                   equ 0001h
LCDDATA19_S25C2_MASK                     equ 0002h
LCDDATA19_S26C2_POSN                     equ 0002h
LCDDATA19_S26C2_POSITION                 equ 0002h
LCDDATA19_S26C2_SIZE                     equ 0001h
LCDDATA19_S26C2_LENGTH                   equ 0001h
LCDDATA19_S26C2_MASK                     equ 0004h
LCDDATA19_S27C2_POSN                     equ 0003h
LCDDATA19_S27C2_POSITION                 equ 0003h
LCDDATA19_S27C2_SIZE                     equ 0001h
LCDDATA19_S27C2_LENGTH                   equ 0001h
LCDDATA19_S27C2_MASK                     equ 0008h
LCDDATA19_S28C2_POSN                     equ 0004h
LCDDATA19_S28C2_POSITION                 equ 0004h
LCDDATA19_S28C2_SIZE                     equ 0001h
LCDDATA19_S28C2_LENGTH                   equ 0001h
LCDDATA19_S28C2_MASK                     equ 0010h
LCDDATA19_S29C2_POSN                     equ 0005h
LCDDATA19_S29C2_POSITION                 equ 0005h
LCDDATA19_S29C2_SIZE                     equ 0001h
LCDDATA19_S29C2_LENGTH                   equ 0001h
LCDDATA19_S29C2_MASK                     equ 0020h
LCDDATA19_S30C2_POSN                     equ 0006h
LCDDATA19_S30C2_POSITION                 equ 0006h
LCDDATA19_S30C2_SIZE                     equ 0001h
LCDDATA19_S30C2_LENGTH                   equ 0001h
LCDDATA19_S30C2_MASK                     equ 0040h
LCDDATA19_S31C2_POSN                     equ 0007h
LCDDATA19_S31C2_POSITION                 equ 0007h
LCDDATA19_S31C2_SIZE                     equ 0001h
LCDDATA19_S31C2_LENGTH                   equ 0001h
LCDDATA19_S31C2_MASK                     equ 0080h
LCDDATA19_T3CKPS019_POSN                 equ 0004h
LCDDATA19_T3CKPS019_POSITION             equ 0004h
LCDDATA19_T3CKPS019_SIZE                 equ 0001h
LCDDATA19_T3CKPS019_LENGTH               equ 0001h
LCDDATA19_T3CKPS019_MASK                 equ 0010h
LCDDATA19_T3CKPS119_POSN                 equ 0005h
LCDDATA19_T3CKPS119_POSITION             equ 0005h
LCDDATA19_T3CKPS119_SIZE                 equ 0001h
LCDDATA19_T3CKPS119_LENGTH               equ 0001h
LCDDATA19_T3CKPS119_MASK                 equ 0020h
LCDDATA19_TMR3CS019_POSN                 equ 0006h
LCDDATA19_TMR3CS019_POSITION             equ 0006h
LCDDATA19_TMR3CS019_SIZE                 equ 0001h
LCDDATA19_TMR3CS019_LENGTH               equ 0001h
LCDDATA19_TMR3CS019_MASK                 equ 0040h
LCDDATA19_TMR3CS119_POSN                 equ 0007h
LCDDATA19_TMR3CS119_POSITION             equ 0007h
LCDDATA19_TMR3CS119_SIZE                 equ 0001h
LCDDATA19_TMR3CS119_LENGTH               equ 0001h
LCDDATA19_TMR3CS119_MASK                 equ 0080h

