GopalSaraf/Practicals/PSDL/include/proc/pic18f65j94.inc
// Register: LCDCON
#define LCDCON LCDCON
LCDCON                                   equ 0ED9h
// bitfield definitions
LCDCON_LMUX_POSN                         equ 0000h
LCDCON_LMUX_POSITION                     equ 0000h
LCDCON_LMUX_SIZE                         equ 0003h
LCDCON_LMUX_LENGTH                       equ 0003h
LCDCON_LMUX_MASK                         equ 0007h
LCDCON_CS_POSN                           equ 0003h
LCDCON_CS_POSITION                       equ 0003h
LCDCON_CS_SIZE                           equ 0002h
LCDCON_CS_LENGTH                         equ 0002h
LCDCON_CS_MASK                           equ 0018h
LCDCON_WERR_POSN                         equ 0005h
LCDCON_WERR_POSITION                     equ 0005h
LCDCON_WERR_SIZE                         equ 0001h
LCDCON_WERR_LENGTH                       equ 0001h
LCDCON_WERR_MASK                         equ 0020h
LCDCON_SLPEN_POSN                        equ 0006h
LCDCON_SLPEN_POSITION                    equ 0006h
LCDCON_SLPEN_SIZE                        equ 0001h
LCDCON_SLPEN_LENGTH                      equ 0001h
LCDCON_SLPEN_MASK                        equ 0040h
LCDCON_LCDEN_POSN                        equ 0007h
LCDCON_LCDEN_POSITION                    equ 0007h
LCDCON_LCDEN_SIZE                        equ 0001h
LCDCON_LCDEN_LENGTH                      equ 0001h
LCDCON_LCDEN_MASK                        equ 0080h
LCDCON_LMUX0_POSN                        equ 0000h
LCDCON_LMUX0_POSITION                    equ 0000h
LCDCON_LMUX0_SIZE                        equ 0001h
LCDCON_LMUX0_LENGTH                      equ 0001h
LCDCON_LMUX0_MASK                        equ 0001h
LCDCON_LMUX1_POSN                        equ 0001h
LCDCON_LMUX1_POSITION                    equ 0001h
LCDCON_LMUX1_SIZE                        equ 0001h
LCDCON_LMUX1_LENGTH                      equ 0001h
LCDCON_LMUX1_MASK                        equ 0002h
LCDCON_LMUX2_POSN                        equ 0002h
LCDCON_LMUX2_POSITION                    equ 0002h
LCDCON_LMUX2_SIZE                        equ 0001h
LCDCON_LMUX2_LENGTH                      equ 0001h
LCDCON_LMUX2_MASK                        equ 0004h
LCDCON_CS0_POSN                          equ 0003h
LCDCON_CS0_POSITION                      equ 0003h
LCDCON_CS0_SIZE                          equ 0001h
LCDCON_CS0_LENGTH                        equ 0001h
LCDCON_CS0_MASK                          equ 0008h
LCDCON_CS1_POSN                          equ 0004h
LCDCON_CS1_POSITION                      equ 0004h
LCDCON_CS1_SIZE                          equ 0001h
LCDCON_CS1_LENGTH                        equ 0001h
LCDCON_CS1_MASK                          equ 0010h

// Register: LCDPS
#define LCDPS LCDPS
LCDPS                                    equ 0EDAh
// bitfield definitions
LCDPS_LP_POSN                            equ 0000h
LCDPS_LP_POSITION                        equ 0000h
LCDPS_LP_SIZE                            equ 0004h
LCDPS_LP_LENGTH                          equ 0004h
LCDPS_LP_MASK                            equ 000Fh
LCDPS_WA_POSN                            equ 0004h
LCDPS_WA_POSITION                        equ 0004h
LCDPS_WA_SIZE                            equ 0001h
LCDPS_WA_LENGTH                          equ 0001h
LCDPS_WA_MASK                            equ 0010h
LCDPS_LCDA_POSN                          equ 0005h
LCDPS_LCDA_POSITION                      equ 0005h
LCDPS_LCDA_SIZE                          equ 0001h
LCDPS_LCDA_LENGTH                        equ 0001h
LCDPS_LCDA_MASK                          equ 0020h
LCDPS_BIASMD_POSN                        equ 0006h
LCDPS_BIASMD_POSITION                    equ 0006h
LCDPS_BIASMD_SIZE                        equ 0001h
LCDPS_BIASMD_LENGTH                      equ 0001h
LCDPS_BIASMD_MASK                        equ 0040h
LCDPS_WFT_POSN                           equ 0007h
LCDPS_WFT_POSITION                       equ 0007h
LCDPS_WFT_SIZE                           equ 0001h
LCDPS_WFT_LENGTH                         equ 0001h
LCDPS_WFT_MASK                           equ 0080h
LCDPS_LP0_POSN                           equ 0000h
LCDPS_LP0_POSITION                       equ 0000h
LCDPS_LP0_SIZE                           equ 0001h
LCDPS_LP0_LENGTH                         equ 0001h
LCDPS_LP0_MASK                           equ 0001h
LCDPS_LP1_POSN                           equ 0001h
LCDPS_LP1_POSITION                       equ 0001h
LCDPS_LP1_SIZE                           equ 0001h
LCDPS_LP1_LENGTH                         equ 0001h
LCDPS_LP1_MASK                           equ 0002h
LCDPS_LP2_POSN                           equ 0002h
LCDPS_LP2_POSITION                       equ 0002h
LCDPS_LP2_SIZE                           equ 0001h
LCDPS_LP2_LENGTH                         equ 0001h
LCDPS_LP2_MASK                           equ 0004h
LCDPS_LP3_POSN                           equ 0003h
LCDPS_LP3_POSITION                       equ 0003h
LCDPS_LP3_SIZE                           equ 0001h
LCDPS_LP3_LENGTH                         equ 0001h
LCDPS_LP3_MASK                           equ 0008h

// Register: REFO2CON3
#define REFO2CON3 REFO2CON3
REFO2CON3                                equ 0EDBh
// bitfield definitions
REFO2CON3_RODIV_POSN                     equ 0000h
REFO2CON3_RODIV_POSITION                 equ 0000h
REFO2CON3_RODIV_SIZE                     equ 0007h
REFO2CON3_RODIV_LENGTH                   equ 0007h
REFO2CON3_RODIV_MASK                     equ 007Fh
REFO2CON3_RODIV8_POSN                    equ 0000h
REFO2CON3_RODIV8_POSITION                equ 0000h
REFO2CON3_RODIV8_SIZE                    equ 0001h
REFO2CON3_RODIV8_LENGTH                  equ 0001h
REFO2CON3_RODIV8_MASK                    equ 0001h
REFO2CON3_RODIV9_POSN                    equ 0001h
REFO2CON3_RODIV9_POSITION                equ 0001h
REFO2CON3_RODIV9_SIZE                    equ 0001h
REFO2CON3_RODIV9_LENGTH                  equ 0001h
REFO2CON3_RODIV9_MASK                    equ 0002h
REFO2CON3_RODIV10_POSN                   equ 0002h
REFO2CON3_RODIV10_POSITION               equ 0002h
REFO2CON3_RODIV10_SIZE                   equ 0001h
REFO2CON3_RODIV10_LENGTH                 equ 0001h
REFO2CON3_RODIV10_MASK                   equ 0004h
REFO2CON3_RODIV11_POSN                   equ 0003h
REFO2CON3_RODIV11_POSITION               equ 0003h
REFO2CON3_RODIV11_SIZE                   equ 0001h
REFO2CON3_RODIV11_LENGTH                 equ 0001h
REFO2CON3_RODIV11_MASK                   equ 0008h
REFO2CON3_RODIV12_POSN                   equ 0004h
REFO2CON3_RODIV12_POSITION               equ 0004h
REFO2CON3_RODIV12_SIZE                   equ 0001h
REFO2CON3_RODIV12_LENGTH                 equ 0001h
REFO2CON3_RODIV12_MASK                   equ 0010h
REFO2CON3_RODIV13_POSN                   equ 0005h
REFO2CON3_RODIV13_POSITION               equ 0005h
REFO2CON3_RODIV13_SIZE                   equ 0001h
REFO2CON3_RODIV13_LENGTH                 equ 0001h
REFO2CON3_RODIV13_MASK                   equ 0020h
REFO2CON3_RODIV14_POSN                   equ 0006h
REFO2CON3_RODIV14_POSITION               equ 0006h
REFO2CON3_RODIV14_SIZE                   equ 0001h
REFO2CON3_RODIV14_LENGTH                 equ 0001h
REFO2CON3_RODIV14_MASK                   equ 0040h

// Register: REFO2CON2
#define REFO2CON2 REFO2CON2
REFO2CON2                                equ 0EDCh
// bitfield definitions
REFO2CON2_RODIV_POSN                     equ 0000h
REFO2CON2_RODIV_POSITION                 equ 0000h
REFO2CON2_RODIV_SIZE                     equ 0008h
REFO2CON2_RODIV_LENGTH                   equ 0008h
REFO2CON2_RODIV_MASK                     equ 00FFh
REFO2CON2_RODIV0_POSN                    equ 0000h
REFO2CON2_RODIV0_POSITION                equ 0000h
REFO2CON2_RODIV0_SIZE                    equ 0001h
REFO2CON2_RODIV0_LENGTH                  equ 0001h
REFO2CON2_RODIV0_MASK                    equ 0001h
REFO2CON2_RODIV1_POSN                    equ 0001h
REFO2CON2_RODIV1_POSITION                equ 0001h
REFO2CON2_RODIV1_SIZE                    equ 0001h
REFO2CON2_RODIV1_LENGTH                  equ 0001h
REFO2CON2_RODIV1_MASK                    equ 0002h
REFO2CON2_RODIV2_POSN                    equ 0002h
REFO2CON2_RODIV2_POSITION                equ 0002h
REFO2CON2_RODIV2_SIZE                    equ 0001h
REFO2CON2_RODIV2_LENGTH                  equ 0001h
REFO2CON2_RODIV2_MASK                    equ 0004h
REFO2CON2_RODIV3_POSN                    equ 0003h
REFO2CON2_RODIV3_POSITION                equ 0003h
REFO2CON2_RODIV3_SIZE                    equ 0001h
REFO2CON2_RODIV3_LENGTH                  equ 0001h
REFO2CON2_RODIV3_MASK                    equ 0008h
REFO2CON2_RODIV4_POSN                    equ 0004h
REFO2CON2_RODIV4_POSITION                equ 0004h
REFO2CON2_RODIV4_SIZE                    equ 0001h
REFO2CON2_RODIV4_LENGTH                  equ 0001h
REFO2CON2_RODIV4_MASK                    equ 0010h
REFO2CON2_RODIV5_POSN                    equ 0005h
REFO2CON2_RODIV5_POSITION                equ 0005h
REFO2CON2_RODIV5_SIZE                    equ 0001h
REFO2CON2_RODIV5_LENGTH                  equ 0001h
REFO2CON2_RODIV5_MASK                    equ 0020h
REFO2CON2_RODIV6_POSN                    equ 0006h
REFO2CON2_RODIV6_POSITION                equ 0006h
REFO2CON2_RODIV6_SIZE                    equ 0001h
REFO2CON2_RODIV6_LENGTH                  equ 0001h
REFO2CON2_RODIV6_MASK                    equ 0040h
REFO2CON2_RODIV7_POSN                    equ 0007h
REFO2CON2_RODIV7_POSITION                equ 0007h
REFO2CON2_RODIV7_SIZE                    equ 0001h
REFO2CON2_RODIV7_LENGTH                  equ 0001h
REFO2CON2_RODIV7_MASK                    equ 0080h

// Register: REFO2CON1
#define REFO2CON1 REFO2CON1
REFO2CON1                                equ 0EDDh
// bitfield definitions
REFO2CON1_ROSEL_POSN                     equ 0000h
REFO2CON1_ROSEL_POSITION                 equ 0000h
REFO2CON1_ROSEL_SIZE                     equ 0004h
REFO2CON1_ROSEL_LENGTH                   equ 0004h
REFO2CON1_ROSEL_MASK                     equ 000Fh
REFO2CON1_ROSEL0_POSN                    equ 0000h
REFO2CON1_ROSEL0_POSITION                equ 0000h
REFO2CON1_ROSEL0_SIZE                    equ 0001h
REFO2CON1_ROSEL0_LENGTH                  equ 0001h
REFO2CON1_ROSEL0_MASK                    equ 0001h
REFO2CON1_ROSEL1_POSN                    equ 0001h
REFO2CON1_ROSEL1_POSITION                equ 0001h
REFO2CON1_ROSEL1_SIZE                    equ 0001h
REFO2CON1_ROSEL1_LENGTH                  equ 0001h
REFO2CON1_ROSEL1_MASK                    equ 0002h
REFO2CON1_ROSEL2_POSN                    equ 0002h
REFO2CON1_ROSEL2_POSITION                equ 0002h
REFO2CON1_ROSEL2_SIZE                    equ 0001h
REFO2CON1_ROSEL2_LENGTH                  equ 0001h
REFO2CON1_ROSEL2_MASK                    equ 0004h
REFO2CON1_ROSEL3_POSN                    equ 0003h
REFO2CON1_ROSEL3_POSITION                equ 0003h
REFO2CON1_ROSEL3_SIZE                    equ 0001h
REFO2CON1_ROSEL3_LENGTH                  equ 0001h
REFO2CON1_ROSEL3_MASK                    equ 0008h

// Register: REFO2CON
#define REFO2CON REFO2CON
REFO2CON                                 equ 0EDEh
// bitfield definitions
REFO2CON_ACTIVE_POSN                     equ 0000h
REFO2CON_ACTIVE_POSITION                 equ 0000h
REFO2CON_ACTIVE_SIZE                     equ 0001h
REFO2CON_ACTIVE_LENGTH                   equ 0001h
REFO2CON_ACTIVE_MASK                     equ 0001h
REFO2CON_DIVSWEN_POSN                    equ 0001h
REFO2CON_DIVSWEN_POSITION                equ 0001h
REFO2CON_DIVSWEN_SIZE                    equ 0001h
REFO2CON_DIVSWEN_LENGTH                  equ 0001h
REFO2CON_DIVSWEN_MASK                    equ 0002h
REFO2CON_ROSSLP_POSN                     equ 0003h
REFO2CON_ROSSLP_POSITION                 equ 0003h
REFO2CON_ROSSLP_SIZE                     equ 0001h
REFO2CON_ROSSLP_LENGTH                   equ 0001h
REFO2CON_ROSSLP_MASK                     equ 0008h
REFO2CON_ROOE_POSN                       equ 0004h
REFO2CON_ROOE_POSITION                   equ 0004h
REFO2CON_ROOE_SIZE                       equ 0001h
REFO2CON_ROOE_LENGTH                     equ 0001h
REFO2CON_ROOE_MASK                       equ 0010h
REFO2CON_ROSIDL_POSN                     equ 0005h
REFO2CON_ROSIDL_POSITION                 equ 0005h
REFO2CON_ROSIDL_SIZE                     equ 0001h
REFO2CON_ROSIDL_LENGTH                   equ 0001h
REFO2CON_ROSIDL_MASK                     equ 0020h
REFO2CON_ROON_POSN                       equ 0007h
REFO2CON_ROON_POSITION                   equ 0007h
REFO2CON_ROON_SIZE                       equ 0001h
REFO2CON_ROON_LENGTH                     equ 0001h
REFO2CON_ROON_MASK                       equ 0080h

// Register: REFO1CON3
#define REFO1CON3 REFO1CON3
REFO1CON3                                equ 0EDFh
// bitfield definitions
REFO1CON3_RODIV_POSN                     equ 0000h
REFO1CON3_RODIV_POSITION                 equ 0000h
REFO1CON3_RODIV_SIZE                     equ 0007h
REFO1CON3_RODIV_LENGTH                   equ 0007h
REFO1CON3_RODIV_MASK                     equ 007Fh
REFO1CON3_RODIV8_POSN                    equ 0000h
REFO1CON3_RODIV8_POSITION                equ 0000h
REFO1CON3_RODIV8_SIZE                    equ 0001h
REFO1CON3_RODIV8_LENGTH                  equ 0001h
REFO1CON3_RODIV8_MASK                    equ 0001h
REFO1CON3_RODIV9_POSN                    equ 0001h
REFO1CON3_RODIV9_POSITION                equ 0001h
REFO1CON3_RODIV9_SIZE                    equ 0001h
REFO1CON3_RODIV9_LENGTH                  equ 0001h
REFO1CON3_RODIV9_MASK                    equ 0002h
REFO1CON3_RODIV10_POSN                   equ 0002h
REFO1CON3_RODIV10_POSITION               equ 0002h
REFO1CON3_RODIV10_SIZE                   equ 0001h
REFO1CON3_RODIV10_LENGTH                 equ 0001h
REFO1CON3_RODIV10_MASK                   equ 0004h
REFO1CON3_RODIV11_POSN                   equ 0003h
REFO1CON3_RODIV11_POSITION               equ 0003h
REFO1CON3_RODIV11_SIZE                   equ 0001h
REFO1CON3_RODIV11_LENGTH                 equ 0001h
REFO1CON3_RODIV11_MASK                   equ 0008h
REFO1CON3_RODIV12_POSN                   equ 0004h
REFO1CON3_RODIV12_POSITION               equ 0004h
REFO1CON3_RODIV12_SIZE                   equ 0001h
REFO1CON3_RODIV12_LENGTH                 equ 0001h
REFO1CON3_RODIV12_MASK                   equ 0010h
REFO1CON3_RODIV13_POSN                   equ 0005h
REFO1CON3_RODIV13_POSITION               equ 0005h
REFO1CON3_RODIV13_SIZE                   equ 0001h
REFO1CON3_RODIV13_LENGTH                 equ 0001h
REFO1CON3_RODIV13_MASK                   equ 0020h
REFO1CON3_RODIV14_POSN                   equ 0006h
REFO1CON3_RODIV14_POSITION               equ 0006h
REFO1CON3_RODIV14_SIZE                   equ 0001h
REFO1CON3_RODIV14_LENGTH                 equ 0001h
REFO1CON3_RODIV14_MASK                   equ 0040h

// Register: REFO1CON2
#define REFO1CON2 REFO1CON2
REFO1CON2                                equ 0EE0h
// bitfield definitions
REFO1CON2_RODIV_POSN                     equ 0000h
REFO1CON2_RODIV_POSITION                 equ 0000h
REFO1CON2_RODIV_SIZE                     equ 0008h
REFO1CON2_RODIV_LENGTH                   equ 0008h
REFO1CON2_RODIV_MASK                     equ 00FFh
REFO1CON2_RODIV0_POSN                    equ 0000h
REFO1CON2_RODIV0_POSITION                equ 0000h
REFO1CON2_RODIV0_SIZE                    equ 0001h
REFO1CON2_RODIV0_LENGTH                  equ 0001h
REFO1CON2_RODIV0_MASK                    equ 0001h
REFO1CON2_RODIV1_POSN                    equ 0001h
REFO1CON2_RODIV1_POSITION                equ 0001h
REFO1CON2_RODIV1_SIZE                    equ 0001h
REFO1CON2_RODIV1_LENGTH                  equ 0001h
REFO1CON2_RODIV1_MASK                    equ 0002h
REFO1CON2_RODIV2_POSN                    equ 0002h
REFO1CON2_RODIV2_POSITION                equ 0002h
REFO1CON2_RODIV2_SIZE                    equ 0001h
REFO1CON2_RODIV2_LENGTH                  equ 0001h
REFO1CON2_RODIV2_MASK                    equ 0004h
REFO1CON2_RODIV3_POSN                    equ 0003h
REFO1CON2_RODIV3_POSITION                equ 0003h
REFO1CON2_RODIV3_SIZE                    equ 0001h
REFO1CON2_RODIV3_LENGTH                  equ 0001h
REFO1CON2_RODIV3_MASK                    equ 0008h
REFO1CON2_RODIV4_POSN                    equ 0004h
REFO1CON2_RODIV4_POSITION                equ 0004h
REFO1CON2_RODIV4_SIZE                    equ 0001h
REFO1CON2_RODIV4_LENGTH                  equ 0001h
REFO1CON2_RODIV4_MASK                    equ 0010h
REFO1CON2_RODIV5_POSN                    equ 0005h
REFO1CON2_RODIV5_POSITION                equ 0005h
REFO1CON2_RODIV5_SIZE                    equ 0001h
REFO1CON2_RODIV5_LENGTH                  equ 0001h
REFO1CON2_RODIV5_MASK                    equ 0020h
REFO1CON2_RODIV6_POSN                    equ 0006h
REFO1CON2_RODIV6_POSITION                equ 0006h
REFO1CON2_RODIV6_SIZE                    equ 0001h
REFO1CON2_RODIV6_LENGTH                  equ 0001h
REFO1CON2_RODIV6_MASK                    equ 0040h
REFO1CON2_RODIV7_POSN                    equ 0007h
REFO1CON2_RODIV7_POSITION                equ 0007h
REFO1CON2_RODIV7_SIZE                    equ 0001h
REFO1CON2_RODIV7_LENGTH                  equ 0001h
REFO1CON2_RODIV7_MASK                    equ 0080h

// Register: REFO1CON1
#define REFO1CON1 REFO1CON1
REFO1CON1                                equ 0EE1h
// bitfield definitions
REFO1CON1_ROSEL_POSN                     equ 0000h
REFO1CON1_ROSEL_POSITION                 equ 0000h
REFO1CON1_ROSEL_SIZE                     equ 0004h
REFO1CON1_ROSEL_LENGTH                   equ 0004h
REFO1CON1_ROSEL_MASK                     equ 000Fh
REFO1CON1_ROSEL0_POSN                    equ 0000h
REFO1CON1_ROSEL0_POSITION                equ 0000h
REFO1CON1_ROSEL0_SIZE                    equ 0001h
REFO1CON1_ROSEL0_LENGTH                  equ 0001h
REFO1CON1_ROSEL0_MASK                    equ 0001h
REFO1CON1_ROSEL1_POSN                    equ 0001h
REFO1CON1_ROSEL1_POSITION                equ 0001h
REFO1CON1_ROSEL1_SIZE                    equ 0001h
REFO1CON1_ROSEL1_LENGTH                  equ 0001h
REFO1CON1_ROSEL1_MASK                    equ 0002h
REFO1CON1_ROSEL2_POSN                    equ 0002h
REFO1CON1_ROSEL2_POSITION                equ 0002h
REFO1CON1_ROSEL2_SIZE                    equ 0001h
REFO1CON1_ROSEL2_LENGTH                  equ 0001h
REFO1CON1_ROSEL2_MASK                    equ 0004h
REFO1CON1_ROSEL3_POSN                    equ 0003h
REFO1CON1_ROSEL3_POSITION                equ 0003h
REFO1CON1_ROSEL3_SIZE                    equ 0001h
REFO1CON1_ROSEL3_LENGTH                  equ 0001h
REFO1CON1_ROSEL3_MASK                    equ 0008h

