GopalSaraf/Practicals/PSDL/include/proc/pic18f65j94.inc
// Register: DMACON1
#define DMACON1 DMACON1
DMACON1                                  equ 0F60h
// bitfield definitions
DMACON1_DMAEN_POSN                       equ 0000h
DMACON1_DMAEN_POSITION                   equ 0000h
DMACON1_DMAEN_SIZE                       equ 0001h
DMACON1_DMAEN_LENGTH                     equ 0001h
DMACON1_DMAEN_MASK                       equ 0001h
DMACON1_DLYINTEN_POSN                    equ 0001h
DMACON1_DLYINTEN_POSITION                equ 0001h
DMACON1_DLYINTEN_SIZE                    equ 0001h
DMACON1_DLYINTEN_LENGTH                  equ 0001h
DMACON1_DLYINTEN_MASK                    equ 0002h
DMACON1_DUPLEX_POSN                      equ 0002h
DMACON1_DUPLEX_POSITION                  equ 0002h
DMACON1_DUPLEX_SIZE                      equ 0002h
DMACON1_DUPLEX_LENGTH                    equ 0002h
DMACON1_DUPLEX_MASK                      equ 000Ch
DMACON1_RXINC_POSN                       equ 0004h
DMACON1_RXINC_POSITION                   equ 0004h
DMACON1_RXINC_SIZE                       equ 0001h
DMACON1_RXINC_LENGTH                     equ 0001h
DMACON1_RXINC_MASK                       equ 0010h
DMACON1_TXINC_POSN                       equ 0005h
DMACON1_TXINC_POSITION                   equ 0005h
DMACON1_TXINC_SIZE                       equ 0001h
DMACON1_TXINC_LENGTH                     equ 0001h
DMACON1_TXINC_MASK                       equ 0020h
DMACON1_SSCON_POSN                       equ 0006h
DMACON1_SSCON_POSITION                   equ 0006h
DMACON1_SSCON_SIZE                       equ 0002h
DMACON1_SSCON_LENGTH                     equ 0002h
DMACON1_SSCON_MASK                       equ 00C0h
DMACON1_DUPLEX0_POSN                     equ 0002h
DMACON1_DUPLEX0_POSITION                 equ 0002h
DMACON1_DUPLEX0_SIZE                     equ 0001h
DMACON1_DUPLEX0_LENGTH                   equ 0001h
DMACON1_DUPLEX0_MASK                     equ 0004h
DMACON1_DUPLEX1_POSN                     equ 0003h
DMACON1_DUPLEX1_POSITION                 equ 0003h
DMACON1_DUPLEX1_SIZE                     equ 0001h
DMACON1_DUPLEX1_LENGTH                   equ 0001h
DMACON1_DUPLEX1_MASK                     equ 0008h
DMACON1_SSCON0_POSN                      equ 0006h
DMACON1_SSCON0_POSITION                  equ 0006h
DMACON1_SSCON0_SIZE                      equ 0001h
DMACON1_SSCON0_LENGTH                    equ 0001h
DMACON1_SSCON0_MASK                      equ 0040h
DMACON1_SSCON1_POSN                      equ 0007h
DMACON1_SSCON1_POSITION                  equ 0007h
DMACON1_SSCON1_SIZE                      equ 0001h
DMACON1_SSCON1_LENGTH                    equ 0001h
DMACON1_SSCON1_MASK                      equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 0F61h
// bitfield definitions
PIE6_CMP1IE_POSN                         equ 0000h
PIE6_CMP1IE_POSITION                     equ 0000h
PIE6_CMP1IE_SIZE                         equ 0001h
PIE6_CMP1IE_LENGTH                       equ 0001h
PIE6_CMP1IE_MASK                         equ 0001h
PIE6_CMP2IE_POSN                         equ 0001h
PIE6_CMP2IE_POSITION                     equ 0001h
PIE6_CMP2IE_SIZE                         equ 0001h
PIE6_CMP2IE_LENGTH                       equ 0001h
PIE6_CMP2IE_MASK                         equ 0002h
PIE6_CMP3IE_POSN                         equ 0002h
PIE6_CMP3IE_POSITION                     equ 0002h
PIE6_CMP3IE_SIZE                         equ 0001h
PIE6_CMP3IE_LENGTH                       equ 0001h
PIE6_CMP3IE_MASK                         equ 0004h
PIE6_TX3IE_POSN                          equ 0004h
PIE6_TX3IE_POSITION                      equ 0004h
PIE6_TX3IE_SIZE                          equ 0001h
PIE6_TX3IE_LENGTH                        equ 0001h
PIE6_TX3IE_MASK                          equ 0010h
PIE6_RC3IE_POSN                          equ 0005h
PIE6_RC3IE_POSITION                      equ 0005h
PIE6_RC3IE_SIZE                          equ 0001h
PIE6_RC3IE_LENGTH                        equ 0001h
PIE6_RC3IE_MASK                          equ 0020h
PIE6_TX4IE_POSN                          equ 0006h
PIE6_TX4IE_POSITION                      equ 0006h
PIE6_TX4IE_SIZE                          equ 0001h
PIE6_TX4IE_LENGTH                        equ 0001h
PIE6_TX4IE_MASK                          equ 0040h
PIE6_RC4IE_POSN                          equ 0007h
PIE6_RC4IE_POSITION                      equ 0007h
PIE6_RC4IE_SIZE                          equ 0001h
PIE6_RC4IE_LENGTH                        equ 0001h
PIE6_RC4IE_MASK                          equ 0080h

// Register: WPUB
#define WPUB WPUB
WPUB                                     equ 0F62h
// bitfield definitions
WPUB_WPUB0_POSN                          equ 0000h
WPUB_WPUB0_POSITION                      equ 0000h
WPUB_WPUB0_SIZE                          equ 0001h
WPUB_WPUB0_LENGTH                        equ 0001h
WPUB_WPUB0_MASK                          equ 0001h
WPUB_WPUB1_POSN                          equ 0001h
WPUB_WPUB1_POSITION                      equ 0001h
WPUB_WPUB1_SIZE                          equ 0001h
WPUB_WPUB1_LENGTH                        equ 0001h
WPUB_WPUB1_MASK                          equ 0002h
WPUB_WPUB2_POSN                          equ 0002h
WPUB_WPUB2_POSITION                      equ 0002h
WPUB_WPUB2_SIZE                          equ 0001h
WPUB_WPUB2_LENGTH                        equ 0001h
WPUB_WPUB2_MASK                          equ 0004h
WPUB_WPUB3_POSN                          equ 0003h
WPUB_WPUB3_POSITION                      equ 0003h
WPUB_WPUB3_SIZE                          equ 0001h
WPUB_WPUB3_LENGTH                        equ 0001h
WPUB_WPUB3_MASK                          equ 0008h
WPUB_WPUB4_POSN                          equ 0004h
WPUB_WPUB4_POSITION                      equ 0004h
WPUB_WPUB4_SIZE                          equ 0001h
WPUB_WPUB4_LENGTH                        equ 0001h
WPUB_WPUB4_MASK                          equ 0010h
WPUB_WPUB5_POSN                          equ 0005h
WPUB_WPUB5_POSITION                      equ 0005h
WPUB_WPUB5_SIZE                          equ 0001h
WPUB_WPUB5_LENGTH                        equ 0001h
WPUB_WPUB5_MASK                          equ 0020h
WPUB_WPUB6_POSN                          equ 0006h
WPUB_WPUB6_POSITION                      equ 0006h
WPUB_WPUB6_SIZE                          equ 0001h
WPUB_WPUB6_LENGTH                        equ 0001h
WPUB_WPUB6_MASK                          equ 0040h
WPUB_WPUB7_POSN                          equ 0007h
WPUB_WPUB7_POSITION                      equ 0007h
WPUB_WPUB7_SIZE                          equ 0001h
WPUB_WPUB7_LENGTH                        equ 0001h
WPUB_WPUB7_MASK                          equ 0080h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 0F63h
// bitfield definitions
ACTCON_ACTORSPOL_POSN                    equ 0000h
ACTCON_ACTORSPOL_POSITION                equ 0000h
ACTCON_ACTORSPOL_SIZE                    equ 0001h
ACTCON_ACTORSPOL_LENGTH                  equ 0001h
ACTCON_ACTORSPOL_MASK                    equ 0001h
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCKPOL_POSN                   equ 0002h
ACTCON_ACTLOCKPOL_POSITION               equ 0002h
ACTCON_ACTLOCKPOL_SIZE                   equ 0001h
ACTCON_ACTLOCKPOL_LENGTH                 equ 0001h
ACTCON_ACTLOCKPOL_MASK                   equ 0004h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTSRC_POSN                       equ 0004h
ACTCON_ACTSRC_POSITION                   equ 0004h
ACTCON_ACTSRC_SIZE                       equ 0001h
ACTCON_ACTSRC_LENGTH                     equ 0001h
ACTCON_ACTSRC_MASK                       equ 0010h
ACTCON_ACTSIDL_POSN                      equ 0005h
ACTCON_ACTSIDL_POSITION                  equ 0005h
ACTCON_ACTSIDL_SIZE                      equ 0001h
ACTCON_ACTSIDL_LENGTH                    equ 0001h
ACTCON_ACTSIDL_MASK                      equ 0020h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

// Register: OSCCON4
#define OSCCON4 OSCCON4
OSCCON4                                  equ 0F64h
// bitfield definitions
OSCCON4_PLLEN_POSN                       equ 0005h
OSCCON4_PLLEN_POSITION                   equ 0005h
OSCCON4_PLLEN_SIZE                       equ 0001h
OSCCON4_PLLEN_LENGTH                     equ 0001h
OSCCON4_PLLEN_MASK                       equ 0020h
OSCCON4_CPDIV_POSN                       equ 0006h
OSCCON4_CPDIV_POSITION                   equ 0006h
OSCCON4_CPDIV_SIZE                       equ 0002h
OSCCON4_CPDIV_LENGTH                     equ 0002h
OSCCON4_CPDIV_MASK                       equ 00C0h
OSCCON4_CPDIV0_POSN                      equ 0006h
OSCCON4_CPDIV0_POSITION                  equ 0006h
OSCCON4_CPDIV0_SIZE                      equ 0001h
OSCCON4_CPDIV0_LENGTH                    equ 0001h
OSCCON4_CPDIV0_MASK                      equ 0040h
OSCCON4_CPDIV1_POSN                      equ 0007h
OSCCON4_CPDIV1_POSITION                  equ 0007h
OSCCON4_CPDIV1_SIZE                      equ 0001h
OSCCON4_CPDIV1_LENGTH                    equ 0001h
OSCCON4_CPDIV1_MASK                      equ 0080h

// Register: OSCCON3
#define OSCCON3 OSCCON3
OSCCON3                                  equ 0F65h
// bitfield definitions
OSCCON3_IRCF_POSN                        equ 0000h
OSCCON3_IRCF_POSITION                    equ 0000h
OSCCON3_IRCF_SIZE                        equ 0003h
OSCCON3_IRCF_LENGTH                      equ 0003h
OSCCON3_IRCF_MASK                        equ 0007h
OSCCON3_IRCF0_POSN                       equ 0000h
OSCCON3_IRCF0_POSITION                   equ 0000h
OSCCON3_IRCF0_SIZE                       equ 0001h
OSCCON3_IRCF0_LENGTH                     equ 0001h
OSCCON3_IRCF0_MASK                       equ 0001h
OSCCON3_IRCF1_POSN                       equ 0001h
OSCCON3_IRCF1_POSITION                   equ 0001h
OSCCON3_IRCF1_SIZE                       equ 0001h
OSCCON3_IRCF1_LENGTH                     equ 0001h
OSCCON3_IRCF1_MASK                       equ 0002h
OSCCON3_IRCF2_POSN                       equ 0002h
OSCCON3_IRCF2_POSITION                   equ 0002h
OSCCON3_IRCF2_SIZE                       equ 0001h
OSCCON3_IRCF2_LENGTH                     equ 0001h
OSCCON3_IRCF2_MASK                       equ 0004h

// Register: OSCCON2
#define OSCCON2 OSCCON2
OSCCON2                                  equ 0F66h
// bitfield definitions
OSCCON2_SOSCGO_POSN                      equ 0001h
OSCCON2_SOSCGO_POSITION                  equ 0001h
OSCCON2_SOSCGO_SIZE                      equ 0001h
OSCCON2_SOSCGO_LENGTH                    equ 0001h
OSCCON2_SOSCGO_MASK                      equ 0002h
OSCCON2_POSCEN_POSN                      equ 0002h
OSCCON2_POSCEN_POSITION                  equ 0002h
OSCCON2_POSCEN_SIZE                      equ 0001h
OSCCON2_POSCEN_LENGTH                    equ 0001h
OSCCON2_POSCEN_MASK                      equ 0004h
OSCCON2_CF_POSN                          equ 0003h
OSCCON2_CF_POSITION                      equ 0003h
OSCCON2_CF_SIZE                          equ 0001h
OSCCON2_CF_LENGTH                        equ 0001h
OSCCON2_CF_MASK                          equ 0008h
OSCCON2_LOCK_POSN                        equ 0005h
OSCCON2_LOCK_POSITION                    equ 0005h
OSCCON2_LOCK_SIZE                        equ 0001h
OSCCON2_LOCK_LENGTH                      equ 0001h
OSCCON2_LOCK_MASK                        equ 0020h
OSCCON2_IOLOCK_POSN                      equ 0006h
OSCCON2_IOLOCK_POSITION                  equ 0006h
OSCCON2_IOLOCK_SIZE                      equ 0001h
OSCCON2_IOLOCK_LENGTH                    equ 0001h
OSCCON2_IOLOCK_MASK                      equ 0040h
OSCCON2_CLKLOCK_POSN                     equ 0007h
OSCCON2_CLKLOCK_POSITION                 equ 0007h
OSCCON2_CLKLOCK_SIZE                     equ 0001h
OSCCON2_CLKLOCK_LENGTH                   equ 0001h
OSCCON2_CLKLOCK_MASK                     equ 0080h

// Register: BAUDCON1
#define BAUDCON1 BAUDCON1
BAUDCON1                                 equ 0F67h
// bitfield definitions
BAUDCON1_ABDEN_POSN                      equ 0000h
BAUDCON1_ABDEN_POSITION                  equ 0000h
BAUDCON1_ABDEN_SIZE                      equ 0001h
BAUDCON1_ABDEN_LENGTH                    equ 0001h
BAUDCON1_ABDEN_MASK                      equ 0001h
BAUDCON1_WUE_POSN                        equ 0001h
BAUDCON1_WUE_POSITION                    equ 0001h
BAUDCON1_WUE_SIZE                        equ 0001h
BAUDCON1_WUE_LENGTH                      equ 0001h
BAUDCON1_WUE_MASK                        equ 0002h
BAUDCON1_IREN_POSN                       equ 0002h
BAUDCON1_IREN_POSITION                   equ 0002h
BAUDCON1_IREN_SIZE                       equ 0001h
BAUDCON1_IREN_LENGTH                     equ 0001h
BAUDCON1_IREN_MASK                       equ 0004h
BAUDCON1_BRG16_POSN                      equ 0003h
BAUDCON1_BRG16_POSITION                  equ 0003h
BAUDCON1_BRG16_SIZE                      equ 0001h
BAUDCON1_BRG16_LENGTH                    equ 0001h
BAUDCON1_BRG16_MASK                      equ 0008h
BAUDCON1_TXCKP_POSN                      equ 0004h
BAUDCON1_TXCKP_POSITION                  equ 0004h
BAUDCON1_TXCKP_SIZE                      equ 0001h
BAUDCON1_TXCKP_LENGTH                    equ 0001h
BAUDCON1_TXCKP_MASK                      equ 0010h
BAUDCON1_RXDTP_POSN                      equ 0005h
BAUDCON1_RXDTP_POSITION                  equ 0005h
BAUDCON1_RXDTP_SIZE                      equ 0001h
BAUDCON1_RXDTP_LENGTH                    equ 0001h
BAUDCON1_RXDTP_MASK                      equ 0020h
BAUDCON1_RCIDL_POSN                      equ 0006h
BAUDCON1_RCIDL_POSITION                  equ 0006h
BAUDCON1_RCIDL_SIZE                      equ 0001h
BAUDCON1_RCIDL_LENGTH                    equ 0001h
BAUDCON1_RCIDL_MASK                      equ 0040h
BAUDCON1_ABDOVF_POSN                     equ 0007h
BAUDCON1_ABDOVF_POSITION                 equ 0007h
BAUDCON1_ABDOVF_SIZE                     equ 0001h
BAUDCON1_ABDOVF_LENGTH                   equ 0001h
BAUDCON1_ABDOVF_MASK                     equ 0080h
BAUDCON1_CKTXP_POSN                      equ 0004h
BAUDCON1_CKTXP_POSITION                  equ 0004h
BAUDCON1_CKTXP_SIZE                      equ 0001h
BAUDCON1_CKTXP_LENGTH                    equ 0001h
BAUDCON1_CKTXP_MASK                      equ 0010h
BAUDCON1_DTRXP_POSN                      equ 0005h
BAUDCON1_DTRXP_POSITION                  equ 0005h
BAUDCON1_DTRXP_SIZE                      equ 0001h
BAUDCON1_DTRXP_LENGTH                    equ 0001h
BAUDCON1_DTRXP_MASK                      equ 0020h
BAUDCON1_SCKP_POSN                       equ 0004h
BAUDCON1_SCKP_POSITION                   equ 0004h
BAUDCON1_SCKP_SIZE                       equ 0001h
BAUDCON1_SCKP_LENGTH                     equ 0001h
BAUDCON1_SCKP_MASK                       equ 0010h
BAUDCON1_RCMT_POSN                       equ 0006h
BAUDCON1_RCMT_POSITION                   equ 0006h
BAUDCON1_RCMT_SIZE                       equ 0001h
BAUDCON1_RCMT_LENGTH                     equ 0001h
BAUDCON1_RCMT_MASK                       equ 0040h
BAUDCON1_ABDEN1_POSN                     equ 0000h
BAUDCON1_ABDEN1_POSITION                 equ 0000h
BAUDCON1_ABDEN1_SIZE                     equ 0001h
BAUDCON1_ABDEN1_LENGTH                   equ 0001h
BAUDCON1_ABDEN1_MASK                     equ 0001h
BAUDCON1_WUE1_POSN                       equ 0001h
BAUDCON1_WUE1_POSITION                   equ 0001h
BAUDCON1_WUE1_SIZE                       equ 0001h
BAUDCON1_WUE1_LENGTH                     equ 0001h
BAUDCON1_WUE1_MASK                       equ 0002h
BAUDCON1_BRG161_POSN                     equ 0003h
BAUDCON1_BRG161_POSITION                 equ 0003h
BAUDCON1_BRG161_SIZE                     equ 0001h
BAUDCON1_BRG161_LENGTH                   equ 0001h
BAUDCON1_BRG161_MASK                     equ 0008h
BAUDCON1_SCKP1_POSN                      equ 0004h
BAUDCON1_SCKP1_POSITION                  equ 0004h
BAUDCON1_SCKP1_SIZE                      equ 0001h
BAUDCON1_SCKP1_LENGTH                    equ 0001h
BAUDCON1_SCKP1_MASK                      equ 0010h
BAUDCON1_DTRXP1_POSN                     equ 0005h
BAUDCON1_DTRXP1_POSITION                 equ 0005h
BAUDCON1_DTRXP1_SIZE                     equ 0001h
BAUDCON1_DTRXP1_LENGTH                   equ 0001h
BAUDCON1_DTRXP1_MASK                     equ 0020h
BAUDCON1_RCIDL1_POSN                     equ 0006h
BAUDCON1_RCIDL1_POSITION                 equ 0006h
BAUDCON1_RCIDL1_SIZE                     equ 0001h
BAUDCON1_RCIDL1_LENGTH                   equ 0001h
BAUDCON1_RCIDL1_MASK                     equ 0040h
BAUDCON1_ABDOVF1_POSN                    equ 0007h
BAUDCON1_ABDOVF1_POSITION                equ 0007h
BAUDCON1_ABDOVF1_SIZE                    equ 0001h
BAUDCON1_ABDOVF1_LENGTH                  equ 0001h
BAUDCON1_ABDOVF1_MASK                    equ 0080h
BAUDCON1_TXCKP1_POSN                     equ 0004h
BAUDCON1_TXCKP1_POSITION                 equ 0004h
BAUDCON1_TXCKP1_SIZE                     equ 0001h
BAUDCON1_TXCKP1_LENGTH                   equ 0001h
BAUDCON1_TXCKP1_MASK                     equ 0010h
BAUDCON1_RXDTP1_POSN                     equ 0005h
BAUDCON1_RXDTP1_POSITION                 equ 0005h
BAUDCON1_RXDTP1_SIZE                     equ 0001h
BAUDCON1_RXDTP1_LENGTH                   equ 0001h
BAUDCON1_RXDTP1_MASK                     equ 0020h
BAUDCON1_RCMT1_POSN                      equ 0006h
BAUDCON1_RCMT1_POSITION                  equ 0006h
BAUDCON1_RCMT1_SIZE                      equ 0001h
BAUDCON1_RCMT1_LENGTH                    equ 0001h
BAUDCON1_RCMT1_MASK                      equ 0040h
BAUDCON1_RXCKP_POSN                      equ 0005h
BAUDCON1_RXCKP_POSITION                  equ 0005h
BAUDCON1_RXCKP_SIZE                      equ 0001h
BAUDCON1_RXCKP_LENGTH                    equ 0001h
BAUDCON1_RXCKP_MASK                      equ 0020h

// Register: SSP1MSK
#define SSP1MSK SSP1MSK
SSP1MSK                                  equ 0F68h
// bitfield definitions
SSP1MSK_SSPMSK_POSN                      equ 0000h
SSP1MSK_SSPMSK_POSITION                  equ 0000h
SSP1MSK_SSPMSK_SIZE                      equ 0008h
SSP1MSK_SSPMSK_LENGTH                    equ 0008h
SSP1MSK_SSPMSK_MASK                      equ 00FFh
SSP1MSK_MSK0_POSN                        equ 0000h
SSP1MSK_MSK0_POSITION                    equ 0000h
SSP1MSK_MSK0_SIZE                        equ 0001h
SSP1MSK_MSK0_LENGTH                      equ 0001h
SSP1MSK_MSK0_MASK                        equ 0001h
SSP1MSK_MSK1_POSN                        equ 0001h
SSP1MSK_MSK1_POSITION                    equ 0001h
SSP1MSK_MSK1_SIZE                        equ 0001h
SSP1MSK_MSK1_LENGTH                      equ 0001h
SSP1MSK_MSK1_MASK                        equ 0002h
SSP1MSK_MSK2_POSN                        equ 0002h
SSP1MSK_MSK2_POSITION                    equ 0002h
SSP1MSK_MSK2_SIZE                        equ 0001h
SSP1MSK_MSK2_LENGTH                      equ 0001h
SSP1MSK_MSK2_MASK                        equ 0004h
SSP1MSK_MSK3_POSN                        equ 0003h
SSP1MSK_MSK3_POSITION                    equ 0003h
SSP1MSK_MSK3_SIZE                        equ 0001h
SSP1MSK_MSK3_LENGTH                      equ 0001h
SSP1MSK_MSK3_MASK                        equ 0008h
SSP1MSK_MSK4_POSN                        equ 0004h
SSP1MSK_MSK4_POSITION                    equ 0004h
SSP1MSK_MSK4_SIZE                        equ 0001h
SSP1MSK_MSK4_LENGTH                      equ 0001h
SSP1MSK_MSK4_MASK                        equ 0010h
SSP1MSK_MSK5_POSN                        equ 0005h
SSP1MSK_MSK5_POSITION                    equ 0005h
SSP1MSK_MSK5_SIZE                        equ 0001h
SSP1MSK_MSK5_LENGTH                      equ 0001h
SSP1MSK_MSK5_MASK                        equ 0020h
SSP1MSK_MSK6_POSN                        equ 0006h
SSP1MSK_MSK6_POSITION                    equ 0006h
SSP1MSK_MSK6_SIZE                        equ 0001h
SSP1MSK_MSK6_LENGTH                      equ 0001h
SSP1MSK_MSK6_MASK                        equ 0040h
SSP1MSK_MSK7_POSN                        equ 0007h
SSP1MSK_MSK7_POSITION                    equ 0007h
SSP1MSK_MSK7_SIZE                        equ 0001h
SSP1MSK_MSK7_LENGTH                      equ 0001h
SSP1MSK_MSK7_MASK                        equ 0080h

// Register: SSP1CON3
#define SSP1CON3 SSP1CON3
SSP1CON3                                 equ 0F69h
// bitfield definitions
SSP1CON3_DHEN_POSN                       equ 0000h
SSP1CON3_DHEN_POSITION                   equ 0000h
SSP1CON3_DHEN_SIZE                       equ 0001h
SSP1CON3_DHEN_LENGTH                     equ 0001h
SSP1CON3_DHEN_MASK                       equ 0001h
SSP1CON3_AHEN_POSN                       equ 0001h
SSP1CON3_AHEN_POSITION                   equ 0001h
SSP1CON3_AHEN_SIZE                       equ 0001h
SSP1CON3_AHEN_LENGTH                     equ 0001h
SSP1CON3_AHEN_MASK                       equ 0002h
SSP1CON3_SBCDE_POSN                      equ 0002h
SSP1CON3_SBCDE_POSITION                  equ 0002h
SSP1CON3_SBCDE_SIZE                      equ 0001h
SSP1CON3_SBCDE_LENGTH                    equ 0001h
SSP1CON3_SBCDE_MASK                      equ 0004h
SSP1CON3_SDAHT_POSN                      equ 0003h
SSP1CON3_SDAHT_POSITION                  equ 0003h
SSP1CON3_SDAHT_SIZE                      equ 0001h
SSP1CON3_SDAHT_LENGTH                    equ 0001h
SSP1CON3_SDAHT_MASK                      equ 0008h
SSP1CON3_BOEN_POSN                       equ 0004h
SSP1CON3_BOEN_POSITION                   equ 0004h
SSP1CON3_BOEN_SIZE                       equ 0001h
SSP1CON3_BOEN_LENGTH                     equ 0001h
SSP1CON3_BOEN_MASK                       equ 0010h
SSP1CON3_SCIE_POSN                       equ 0005h
SSP1CON3_SCIE_POSITION                   equ 0005h
SSP1CON3_SCIE_SIZE                       equ 0001h
SSP1CON3_SCIE_LENGTH                     equ 0001h
SSP1CON3_SCIE_MASK                       equ 0020h
SSP1CON3_PCIE_POSN                       equ 0006h
SSP1CON3_PCIE_POSITION                   equ 0006h
SSP1CON3_PCIE_SIZE                       equ 0001h
SSP1CON3_PCIE_LENGTH                     equ 0001h
SSP1CON3_PCIE_MASK                       equ 0040h
SSP1CON3_ACKTIM_POSN                     equ 0007h
SSP1CON3_ACKTIM_POSITION                 equ 0007h
SSP1CON3_ACKTIM_SIZE                     equ 0001h
SSP1CON3_ACKTIM_LENGTH                   equ 0001h
SSP1CON3_ACKTIM_MASK                     equ 0080h

