GopalSaraf/Practicals/PSDL/include/proc/pic18f65j94.inc
// Register: RXADDRL
#define RXADDRL RXADDRL
RXADDRL                                  equ 0F6Eh
// bitfield definitions
RXADDRL_DMARCVPTRLB_POSN                 equ 0000h
RXADDRL_DMARCVPTRLB_POSITION             equ 0000h
RXADDRL_DMARCVPTRLB_SIZE                 equ 0008h
RXADDRL_DMARCVPTRLB_LENGTH               equ 0008h
RXADDRL_DMARCVPTRLB_MASK                 equ 00FFh
RXADDRL_RXADDR0_POSN                     equ 0000h
RXADDRL_RXADDR0_POSITION                 equ 0000h
RXADDRL_RXADDR0_SIZE                     equ 0001h
RXADDRL_RXADDR0_LENGTH                   equ 0001h
RXADDRL_RXADDR0_MASK                     equ 0001h
RXADDRL_RXADDR1_POSN                     equ 0001h
RXADDRL_RXADDR1_POSITION                 equ 0001h
RXADDRL_RXADDR1_SIZE                     equ 0001h
RXADDRL_RXADDR1_LENGTH                   equ 0001h
RXADDRL_RXADDR1_MASK                     equ 0002h
RXADDRL_RXADDR2_POSN                     equ 0002h
RXADDRL_RXADDR2_POSITION                 equ 0002h
RXADDRL_RXADDR2_SIZE                     equ 0001h
RXADDRL_RXADDR2_LENGTH                   equ 0001h
RXADDRL_RXADDR2_MASK                     equ 0004h
RXADDRL_RXADDR3_POSN                     equ 0003h
RXADDRL_RXADDR3_POSITION                 equ 0003h
RXADDRL_RXADDR3_SIZE                     equ 0001h
RXADDRL_RXADDR3_LENGTH                   equ 0001h
RXADDRL_RXADDR3_MASK                     equ 0008h
RXADDRL_RXADDR4_POSN                     equ 0004h
RXADDRL_RXADDR4_POSITION                 equ 0004h
RXADDRL_RXADDR4_SIZE                     equ 0001h
RXADDRL_RXADDR4_LENGTH                   equ 0001h
RXADDRL_RXADDR4_MASK                     equ 0010h
RXADDRL_RXADDR5_POSN                     equ 0005h
RXADDRL_RXADDR5_POSITION                 equ 0005h
RXADDRL_RXADDR5_SIZE                     equ 0001h
RXADDRL_RXADDR5_LENGTH                   equ 0001h
RXADDRL_RXADDR5_MASK                     equ 0020h
RXADDRL_RXADDR6_POSN                     equ 0006h
RXADDRL_RXADDR6_POSITION                 equ 0006h
RXADDRL_RXADDR6_SIZE                     equ 0001h
RXADDRL_RXADDR6_LENGTH                   equ 0001h
RXADDRL_RXADDR6_MASK                     equ 0040h
RXADDRL_RXADDR7_POSN                     equ 0007h
RXADDRL_RXADDR7_POSITION                 equ 0007h
RXADDRL_RXADDR7_SIZE                     equ 0001h
RXADDRL_RXADDR7_LENGTH                   equ 0001h
RXADDRL_RXADDR7_MASK                     equ 0080h

// Register: TXADDRH
#define TXADDRH TXADDRH
TXADDRH                                  equ 0F6Fh
// bitfield definitions
TXADDRH_DMATXPTRHB_POSN                  equ 0000h
TXADDRH_DMATXPTRHB_POSITION              equ 0000h
TXADDRH_DMATXPTRHB_SIZE                  equ 0004h
TXADDRH_DMATXPTRHB_LENGTH                equ 0004h
TXADDRH_DMATXPTRHB_MASK                  equ 000Fh
TXADDRH_TXADDR8_POSN                     equ 0000h
TXADDRH_TXADDR8_POSITION                 equ 0000h
TXADDRH_TXADDR8_SIZE                     equ 0001h
TXADDRH_TXADDR8_LENGTH                   equ 0001h
TXADDRH_TXADDR8_MASK                     equ 0001h
TXADDRH_TXADDR9_POSN                     equ 0001h
TXADDRH_TXADDR9_POSITION                 equ 0001h
TXADDRH_TXADDR9_SIZE                     equ 0001h
TXADDRH_TXADDR9_LENGTH                   equ 0001h
TXADDRH_TXADDR9_MASK                     equ 0002h
TXADDRH_TXADDR10_POSN                    equ 0002h
TXADDRH_TXADDR10_POSITION                equ 0002h
TXADDRH_TXADDR10_SIZE                    equ 0001h
TXADDRH_TXADDR10_LENGTH                  equ 0001h
TXADDRH_TXADDR10_MASK                    equ 0004h
TXADDRH_TXADDR11_POSN                    equ 0003h
TXADDRH_TXADDR11_POSITION                equ 0003h
TXADDRH_TXADDR11_SIZE                    equ 0001h
TXADDRH_TXADDR11_LENGTH                  equ 0001h
TXADDRH_TXADDR11_MASK                    equ 0008h

// Register: TXADDRL
#define TXADDRL TXADDRL
TXADDRL                                  equ 0F70h
// bitfield definitions
TXADDRL_DMATXPTRLB_POSN                  equ 0000h
TXADDRL_DMATXPTRLB_POSITION              equ 0000h
TXADDRL_DMATXPTRLB_SIZE                  equ 0008h
TXADDRL_DMATXPTRLB_LENGTH                equ 0008h
TXADDRL_DMATXPTRLB_MASK                  equ 00FFh
TXADDRL_TXADDR0_POSN                     equ 0000h
TXADDRL_TXADDR0_POSITION                 equ 0000h
TXADDRL_TXADDR0_SIZE                     equ 0001h
TXADDRL_TXADDR0_LENGTH                   equ 0001h
TXADDRL_TXADDR0_MASK                     equ 0001h
TXADDRL_TXADDR1_POSN                     equ 0001h
TXADDRL_TXADDR1_POSITION                 equ 0001h
TXADDRL_TXADDR1_SIZE                     equ 0001h
TXADDRL_TXADDR1_LENGTH                   equ 0001h
TXADDRL_TXADDR1_MASK                     equ 0002h
TXADDRL_TXADDR2_POSN                     equ 0002h
TXADDRL_TXADDR2_POSITION                 equ 0002h
TXADDRL_TXADDR2_SIZE                     equ 0001h
TXADDRL_TXADDR2_LENGTH                   equ 0001h
TXADDRL_TXADDR2_MASK                     equ 0004h
TXADDRL_TXADDR3_POSN                     equ 0003h
TXADDRL_TXADDR3_POSITION                 equ 0003h
TXADDRL_TXADDR3_SIZE                     equ 0001h
TXADDRL_TXADDR3_LENGTH                   equ 0001h
TXADDRL_TXADDR3_MASK                     equ 0008h
TXADDRL_TXADDR4_POSN                     equ 0004h
TXADDRL_TXADDR4_POSITION                 equ 0004h
TXADDRL_TXADDR4_SIZE                     equ 0001h
TXADDRL_TXADDR4_LENGTH                   equ 0001h
TXADDRL_TXADDR4_MASK                     equ 0010h
TXADDRL_TXADDR5_POSN                     equ 0005h
TXADDRL_TXADDR5_POSITION                 equ 0005h
TXADDRL_TXADDR5_SIZE                     equ 0001h
TXADDRL_TXADDR5_LENGTH                   equ 0001h
TXADDRL_TXADDR5_MASK                     equ 0020h
TXADDRL_TXADDR6_POSN                     equ 0006h
TXADDRL_TXADDR6_POSITION                 equ 0006h
TXADDRL_TXADDR6_SIZE                     equ 0001h
TXADDRL_TXADDR6_LENGTH                   equ 0001h
TXADDRL_TXADDR6_MASK                     equ 0040h
TXADDRL_TXADDR7_POSN                     equ 0007h
TXADDRL_TXADDR7_POSITION                 equ 0007h
TXADDRL_TXADDR7_SIZE                     equ 0001h
TXADDRL_TXADDR7_LENGTH                   equ 0001h
TXADDRL_TXADDR7_MASK                     equ 0080h

